---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResult.EdgeObject
source: html/4e4cc05e-b264-7a9e-5d49-8af876165d9b.htm
---
# Autodesk.Revit.DB.IntersectionResult.EdgeObject Property

Edge of the face close to the point of intersection.

## Syntax (C#)
```csharp
public Edge EdgeObject { get; internal set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown in the getter when this property has not been set by the method providing the result.